[Killed] StringLiteral
src/Components/Signin.js:16:20
     const formik = useFormik({
         initialValues: {
           email: '',
-          password:''
+          password:"Stryker was here!"
         },
         validate,
killedBy: Signin component testing Signin component snapshot testing 
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Signin component testing Signin component snapshot testing  1`

- Snapshot  - 1
+ Received  + 1

@@ -93,11 +93,11 @@

[Killed] BlockStatement
src/Components/Signin.js:19:36
           password:''
         },
         validate,
-        onSubmit: async(values) => {
-            const userDeatils ={
-                email:values.email,
-                password:values.password
-            }
-          const response = await axios.post('/shopping/api/v1/login',userDeatils);
-          if(response.data.statusCode === 200 && response.data.statusMessage === "success!" )
-          {
-            setIsSuccessLogin("success")
-            navigate('/');
-          }
-          else if(response.data.statusCode === 403 || response.data.statusMessage === "error!"){
-            setIsSuccessLogin("error")
-          }
-        },
+        onSubmit: async(values) => {},
       });
 
killedBy: Signin component testing succesfully loggedin to my website!
statusReason: Error: Unable to find an element with the text: Successfully you have loggedIn!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section
      class="container gradient-form rounded-3"
      style="background-image: url(htt

[Killed] ObjectLiteral
src/Components/Signin.js:20:32
         },
         validate,
         onSubmit: async(values) => {
-            const userDeatils ={
-                email:values.email,
-                password:values.password
-            }
+            const userDeatils ={}
           const response = await axios.post('/shopping/api/v1/login',userDeatils);
           if(response.data.statusCode === 200 && response.data.statusMessage === "success!" )
killedBy: Signin component testing succesfully loggedin to my website!
statusReason: Error: Unable to find an element with the text: Successfully you have loggedIn!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section
      class="container gradient-form rounded-3"
      style="background-image: url(htt

[Killed] EqualityOperator
src/Components/Signin.js:25:50
                 password:values.password
             }
           const response = await axios.post('/shopping/api/v1/login',userDeatils);
-          if(response.data.statusCode === 200 && response.data.statusMessage === "success!" )
+          if(response.data.statusCode === 200 && response.data.statusMessage !== "success!" )
           {
             setIsSuccessLogin("success")
killedBy: Signin component testing succesfully loggedin to my website!
statusReason: Error: Unable to find an element with the text: Successfully you have loggedIn!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section
      class="container gradient-form rounded-3"
      style="background-image: url(htt

[Killed] EqualityOperator
src/Components/Signin.js:25:14
                 password:values.password
             }
           const response = await axios.post('/shopping/api/v1/login',userDeatils);
-          if(response.data.statusCode === 200 && response.data.statusMessage === "success!" )
+          if(response.data.statusCode !== 200 && response.data.statusMessage === "success!" )
           {
             setIsSuccessLogin("success")
killedBy: Signin component testing succesfully loggedin to my website!
statusReason: Error: Unable to find an element with the text: Successfully you have loggedIn!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section
      class="container gradient-form rounded-3"
      style="background-image: url(htt

[Killed] BlockStatement
src/Components/Signin.js:26:11
             }
           const response = await axios.post('/shopping/api/v1/login',userDeatils);
           if(response.data.statusCode === 200 && response.data.statusMessage === "success!" )
-          {
-            setIsSuccessLogin("success")
-            navigate('/');
-          }
+          {}
           else if(response.data.statusCode === 403 || response.data.statusMessage === "error!"){
             setIsSuccessLogin("error")
killedBy: Signin component testing succesfully loggedin to my website!
statusReason: Error: Unable to find an element with the text: Successfully you have loggedIn!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section
      class="container gradient-form rounded-3"
      style="background-image: url(htt

[Killed] StringLiteral
src/Components/Signin.js:27:31
           const response = await axios.post('/shopping/api/v1/login',userDeatils);
           if(response.data.statusCode === 200 && response.data.statusMessage === "success!" )
           {
-            setIsSuccessLogin("success")
+            setIsSuccessLogin("")
             navigate('/');
           }
killedBy: Signin component testing succesfully loggedin to my website!
statusReason: Error: Unable to find an element with the text: Successfully you have loggedIn!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section
      class="container gradient-form rounded-3"
      style="background-image: url(htt

[Survived] StringLiteral
src/Components/Signin.js:28:22
           if(response.data.statusCode === 200 && response.data.statusMessage === "success!" )
           {
             setIsSuccessLogin("success")
-            navigate('/');
+            navigate("");
           }
           else if(response.data.statusCode === 403 || response.data.statusMessage === "error!"){

[Killed] ConditionalExpression
src/Components/Signin.js:30:19
             setIsSuccessLogin("success")
             navigate('/');
           }
-          else if(response.data.statusCode === 403 || response.data.statusMessage === "error!"){
+          else if(false){
             setIsSuccessLogin("error")
           }
killedBy: Signin component testing Failed to login to my website!
statusReason: Error: Unable to find an element with the text: email or password is wrong!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section
      class="container gradient-form rounded-3"
      style="background-image: url(https:/

[Killed] BlockStatement
src/Components/Signin.js:30:96
             setIsSuccessLogin("success")
             navigate('/');
           }
-          else if(response.data.statusCode === 403 || response.data.statusMessage === "error!"){
-            setIsSuccessLogin("error")
-          }
+          else if(response.data.statusCode === 403 || response.data.statusMessage === "error!"){}
         },
       });
killedBy: Signin component testing Failed to login to my website!
statusReason: Error: Unable to find an element with the text: email or password is wrong!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section
      class="container gradient-form rounded-3"
      style="background-image: url(https:/

[Killed] StringLiteral
src/Components/Signin.js:31:31
             navigate('/');
           }
           else if(response.data.statusCode === 403 || response.data.statusMessage === "error!"){
-            setIsSuccessLogin("error")
+            setIsSuccessLogin("")
           }
         },
killedBy: Signin component testing Failed to login to my website!
statusReason: Error: Unable to find an element with the text: email or password is wrong!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section
      class="container gradient-form rounded-3"
      style="background-image: url(https:/

[Survived] BlockStatement
src/Components/Signin.js:36:37
         },
       });
 
-   const redirectToSignUpPage = ()=>{
-    navigate('/');
-   }
+   const redirectToSignUpPage = ()=>{}
     return(
     <>

[Killed] ObjectLiteral
src/Components/Signin.js:41:67
    }
     return(
     <>
-    <section className="container gradient-form rounded-3" style={{backgroundImage: "url('https://mdbcdn.b-cdn.net/img/Photos/new-templates/search-box/img4.webp')"}}>
+    <section className="container gradient-form rounded-3" style={{}}>
         <div className="container py-5">
             <div className="row d-flex justify-content-center align-items-center">
killedBy: Signin component testing Signin component snapshot testing 
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Signin component testing Signin component snapshot testing  1`

- Snapshot  - 5
+ Received  + 1

@@ -1,13 +1,9 @@

[Killed] ConditionalExpression
src/Components/Signin.js:49:26
                 <div className="row g-0">
                     <div className="col-lg-6">
                     <div className="card-body p-md-5 mx-md-4">
-                        {isSuccessLogin && isSuccessLogin === "success" ?
+                        {true ?
                           <div className="alert alert-success">
                           <strong>Successfully you have loggedIn!</strong>
killedBy: Signin component testing Signin component snapshot testing 
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Signin component testing Signin component snapshot testing  1`

- Snapshot  - 0
+ Received  + 7

@@ -27,10 +27,17 @@

[Killed] ConditionalExpression
src/Components/Signin.js:49:44
                 <div className="row g-0">
                     <div className="col-lg-6">
                     <div className="card-body p-md-5 mx-md-4">
-                        {isSuccessLogin && isSuccessLogin === "success" ?
+                        {isSuccessLogin && true ?
                           <div className="alert alert-success">
                           <strong>Successfully you have loggedIn!</strong>
killedBy: Signin component testing Failed to login to my website!
statusReason: Error: Unable to find an element with the text: email or password is wrong!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section
      class="container gradient-form rounded-3"
      style="background-image: url(https:/

[Killed] ConditionalExpression
src/Components/Signin.js:52:33
                         {isSuccessLogin && isSuccessLogin === "success" ?
                           <div className="alert alert-success">
                           <strong>Successfully you have loggedIn!</strong>
-                         </div>:isSuccessLogin && isSuccessLogin === "error" ?<div className="alert alert-danger">
+                         </div>:true ?<div className="alert alert-danger">
                          <strong>email or password is wrong!</strong>
                          </div>:null
killedBy: Signin component testing Signin component snapshot testing 
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Signin component testing Signin component snapshot testing  1`

- Snapshot  - 0
+ Received  + 7

@@ -27,10 +27,17 @@

[Timeout] ConditionalExpression
src/Components/Signin.js:52:33
                         {isSuccessLogin && isSuccessLogin === "success" ?
                           <div className="alert alert-success">
                           <strong>Successfully you have loggedIn!</strong>
-                         </div>:isSuccessLogin && isSuccessLogin === "error" ?<div className="alert alert-danger">
+                         </div>:false ?<div className="alert alert-danger">
                          <strong>email or password is wrong!</strong>
                          </div>:null

[Killed] StringLiteral
src/Components/Signin.js:59:44
                         
                         <div className="text-center">
                         <img src="https://mdbcdn.b-cdn.net/img/Photos/new-templates/bootstrap-login-form/lotus.webp"
-                            style={{width: "185px"}} alt="logo"/>
+                            style={{width: ""}} alt="logo"/>
                         <h4 className="mt-1 mb-5 pb-1 clipImage">We are The Lotus Team</h4>
                         </div>
killedBy: Signin component testing Signin component snapshot testing 
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Signin component testing Signin component snapshot testing  1`

- Snapshot  - 1
+ Received  + 1

@@ -34,11 +34,11 @@

[Killed] ConditionalExpression
src/Components/Signin.js:70:30
                         <span className="btn btn-outline-secondary form-field-mandatory-icon"><i className="bi bi-envelope-at-fill"></i></span> 
                             />
-                            {formik.touched.email && formik.errors.email ? (
+                            {false ? (
                                 <label className="form-check-label ms-2 text-danger" htmlFor="femaleGender">{formik.errors.email}</label>
                             ) : null}
killedBy: Signin component testing check error message for invalid email address
statusReason: Error: Unable to find an element with the text: Invalid email address. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section
      class="container gradient-form rounded-3"
      style="background-image: url(https://mdbcd

[Killed] ConditionalExpression
src/Components/Signin.js:70:30
                         <span className="btn btn-outline-secondary form-field-mandatory-icon"><i className="bi bi-envelope-at-fill"></i></span> 
                             />
-                            {formik.touched.email && formik.errors.email ? (
+                            {true ? (
                                 <label className="form-check-label ms-2 text-danger" htmlFor="femaleGender">{formik.errors.email}</label>
                             ) : null}
killedBy: Signin component testing Signin component snapshot testing 
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Signin component testing Signin component snapshot testing  1`

- Snapshot  - 0
+ Received  + 4

@@ -73,10 +73,14 @@

[Killed] ConditionalExpression
src/Components/Signin.js:88:30
                             className="form-control form-control-md" 
                             placeholder="Password"
                             />
-                            {formik.touched.password && formik.errors.password ? (
+                            {true ? (
                                 <label className="lform-check-labe ms-2 text-danger" htmlFor="femaleGender">{formik.errors.password}</label>
                             ) : null}
killedBy: Signin component testing Signin component snapshot testing 
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Signin component testing Signin component snapshot testing  1`

- Snapshot  - 0
+ Received  + 4

@@ -95,10 +95,14 @@

[Killed] ConditionalExpression
src/Components/Signin.js:88:30
                             className="form-control form-control-md" 
                             placeholder="Password"
                             />
-                            {formik.touched.password && formik.errors.password ? (
+                            {false ? (
                                 <label className="lform-check-labe ms-2 text-danger" htmlFor="femaleGender">{formik.errors.password}</label>
                             ) : null}
killedBy: Signin component testing Check validation error message for email!
statusReason: Error: Unable to find an element with the text: Required. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section
      class="container gradient-form rounded-3"
      style="background-image: url(https://mdbcdn.b-cdn.net/i
